# Week 11 Data Loading and Storage

Accessing data is a necessary first step for most data science projects. From this chapter we will learn:
- Reading and writing data in text format (.txt, .csv, .json)
- Reading and writing data in binary format (.pickle, .feather, .h5)
- Interacting with databases

Reading:
- Textbook, Chapter 6

## I. Reading and Writing Data in Text Format

### 1. csv file

In [1]:
# Let's create a data frame first
import numpy as np
import pandas as pd

values = np.array([
    [100, 80, 95, 'A'],
    [55, 60, 45, 'F'],
    [70, 75, 90, 'A'],
    [75, 70, 60, 'D'],
    [60, 73, 75, 'C'],
    [72, 63, -1, 'NA']
])
df = pd.DataFrame(values,
                   columns=['Midterm', 'Project', 'Final', 'LetterGrade'],
                   index=['Alex', 'Bob', 'Chris', 'Doug', 'Eva', "Frank"])
df

      Midterm Project Final LetterGrade
Alex      100      80    95           A
Bob        55      60    45           F
Chris      70      75    90           A
Doug       75      70    60           D
Eva        60      73    75           C
Frank      72      63    -1          NA

In [2]:
# Write to a csv file using .to_csv()
import os

print('Does path "Data/temp/" exist?', os.path.exists("Data/temp/"))

if not os.path.exists("Data/temp/"):
#     os.mkdir("Data/temp") # This only works on Windows
    os.makedirs("Data/temp")
    print('File path "Data/temp/" created.')

# df.to_csv("Data/temp/grades.csv", index=False)
df.to_csv("Data/temp/grades.csv")

Does path "Data/temp/" exist? True

In [12]:
# Load the csv file
df2 = pd.read_csv("Data/temp/grades.csv")
df2

  Unnamed: 0  Midterm  Project  Final LetterGrade
0       Alex      100       80     95           A
1        Bob       55       60     45           F
2      Chris       70       75     90           A
3       Doug       75       70     60           D
4        Eva       60       73     75           C
5      Frank       72       63     -1         NaN

In [3]:
# Load the csv file and make the names row indices
df3 = pd.read_csv("Data/temp/grades.csv", index_col="Unnamed: 0")
df3 = pd.read_csv("Data/temp/grades.csv", index_col=0)
df3

       Midterm  Project  Final LetterGrade
Alex       100       80     95           A
Bob         55       60     45           F
Chris       70       75     90           A
Doug        75       70     60           D
Eva         60       73     75           C
Frank       72       63     -1         NaN

In [4]:
# Load only the first 3 rows
df3 = pd.read_csv("Data/temp/grades.csv", nrows=3, index_col=0)
df3

       Midterm  Project  Final LetterGrade
Alex       100       80     95           A
Bob         55       60     45           F
Chris       70       75     90           A

In [5]:
# Load the file, skipping row 2 and 4
# df4 = pd.read_csv("Data/temp/grades.csv", sep=',', skiprows=[2, 4])
df4 = pd.read_csv("Data/temp/grades.csv", skiprows=[0, 2])
df4

    Alex  100  80  95    A
0  Chris   70  75  90    A
1   Doug   75  70  60    D
2    Eva   60  73  75    C
3  Frank   72  63  -1  NaN

In [7]:
# Load a selection of columns
# df4 = pd.read_csv("Data/temp/grades.csv", usecols=[0, 1])
df4 = pd.read_csv("Data/temp/grades.csv", usecols=["Project", "Final"])
df4

   Project  Final
0       80     95
1       60     45
2       75     90
3       70     60
4       73     75
5       63     -1

In [8]:
# Remove column headers from the csv file, then load it
# df5 = pd.read_csv("Data/temp/grades.csv", header=3)
df5 = pd.read_csv("Data/temp/grades.csv",names=['Name', 'Midterm', 'Project', 'Final', 'LetterGrade'])
df5

    Name  Midterm  Project  Final  LetterGrade
0    NaN  Midterm  Project  Final  LetterGrade
1   Alex      100       80     95            A
2    Bob       55       60     45            F
3  Chris       70       75     90            A
4   Doug       75       70     60            D
5    Eva       60       73     75            C
6  Frank       72       63     -1          NaN

In [ ]:
# Set first column as index
df6 = pd.read_csv("Data/temp/grades.csv", sep=',', index_col=0)
df6

In [9]:
# Identify -1 as NaN
df7 = pd.read_csv("Data/temp/grades.csv", delimiter=',', na_values=[-1])
# df7 = pd.read_csv("Data/temp/grades.csv")
df7

  Unnamed: 0  Midterm  Project  Final LetterGrade
0       Alex      100       80   95.0           A
1        Bob       55       60   45.0           F
2      Chris       70       75   90.0           A
3       Doug       75       70   60.0           D
4        Eva       60       73   75.0           C
5      Frank       72       63    NaN         NaN

In [11]:
# Count the number of missing values
df7.isnull().sum()
pd.isnull(df7).sum()

Unnamed: 0     0
Midterm        0
Project        0
Final          1
LetterGrade    1
dtype: int64

In [12]:
# Ex: Tell me what the data frame will look like.
temp = pd.read_csv("Data/temp/grades.csv", skiprows=[3, 4], index_col=4)
temp

            Unnamed: 0  Midterm  Project  Final
LetterGrade
A                 Alex      100       80     95
F                  Bob       55       60     45
C                  Eva       60       73     75
NaN              Frank       72       63     -1

### 2. Load txt file with values separated by spaces

In [14]:
with open("Data/temp/values.txt", 'w') as file:
    file.write("Index Category     Value\n")
    file.write("1            A      2.92\n")
    file.write("2            B     12.14\n")
    file.write("3            C    123.56\n")

In [15]:
df = pd.read_csv("Data/temp/values.txt")
df

   Index Category     Value
0  1            A      2.92
1  2            B     12.14
2  3            C    123.56

In [16]:
# Although read_csv() is still applicable, setting delimiter to a single space will create errors
df = pd.read_csv("Data/temp/values.txt", sep=" ")
df

,,,,,,,,,,,,Index,Category,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Value
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A,NaN,NaN,NaN,NaN,NaN,2.92
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,B,NaN,NaN,NaN,NaN,12.14,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,C,NaN,NaN,NaN,123.56,NaN,NaN

In [17]:
df = pd.read_csv("Data/temp/values.txt", sep="\s+") # \s+ is the regular expression for a sequence of white spaces
df

   Index Category   Value
0      1        A    2.92
1      2        B   12.14
2      3        C  123.56

### 3. Load JSON files

**JavaScript Object Notation (JSON)** is a popular file format to storing unstructured data because it is easy for both human and computer to understand.
- Its structure is very similar to Python dictionary
- Load a json file with json.loads()
- Writes to a json file with json.dump()

In [43]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [44]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [45]:
?result

In [46]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [47]:
# Use json.dump(object, file) to write the content to file
with open("Data/temp/People.json", 'w') as file:
    json.dump(result, file)

In [48]:
# Load from People.json
with open("Data/temp/People.json", "r") as file:
    people = json.load(file)
people

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [49]:
# Load the content as a data frame
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age', 'pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

# II. Binary File Formats

## 1. pickle
The `pickle` module implements binary protocols for serializing and de-serializing a Python object structure. Only Python can properly read and write pickle files

In [50]:
# Let's create a data frame first
import numpy as np
import pandas as pd

values = np.array([
    [100, 80, 95, 'A'],
    [55, 60, 45, 'F'],
    [70, 75, 90, 'A'],
    [75, 70, 60, 'D'],
    [60, 73, 75, 'C'],
    [72, 63, -1, 'NA']
])
df = pd.DataFrame(values,
                   columns=['Midterm', 'Project', 'Final', 'LetterGrade'],
                   index=['Alex', 'Bob', 'Chris', 'Doug', 'Eva', "Frank"])
df

      Midterm Project Final LetterGrade
Alex      100      80    95           A
Bob        55      60    45           F
Chris      70      75    90           A
Doug       75      70    60           D
Eva        60      73    75           C
Frank      72      63    -1          NA

In [51]:
# Save as a .pickle file
df.to_pickle("Data/temp/data.pickle")

In [52]:
# Load the pickle file
df_pickle = pd.read_pickle("Data/temp/data.pickle")
df_pickle

      Midterm Project Final LetterGrade
Alex      100      80    95           A
Bob        55      60    45           F
Chris      70      75    90           A
Doug       75      70    60           D
Eva        60      73    75           C
Frank      72      63    -1          NA

## 2. HDF5
The "HDF" stands for "hierarchical data format". HDF5 can be a good choice for working with very large datasets that don't fit into memory, as you can efficiently read and write small sections of large arrays.

In [53]:
df = pd.DataFrame({
    'Col1': np.random.randn(100),
    'Col2': np.random.randn(100)
})
df.head(5)

       Col1      Col2
0 -1.540538 -1.545130
1 -0.093953 -0.100321
2  0.460840  1.122858
3 -0.806358  0.414657
4 -1.295381  0.890595

In [54]:
# The PyTable package may require update
!pip3 install --upgrade tables

Requirement already satisfied: tables in c:\users\lzhao\anaconda3\lib\site-packages (3.6.1)
Requirement already satisfied: numpy>=1.9.3 in c:\users\lzhao\anaconda3\lib\site-packages (from tables) (1.18.5)
Requirement already satisfied: numexpr>=2.6.2 in c:\users\lzhao\anaconda3\lib\site-packages (from tables) (2.7.1)

WARNING: You are using pip version 21.3; however, version 21.3.1 is available.
You should consider upgrading via the 'c:\users\lzhao\anaconda3\python.exe -m pip install --upgrade pip' command.

In [55]:
df.to_hdf('Data/temp/data.h5', 'obj1', format='table')

In [56]:
df_hdf5 = pd.read_hdf('Data/temp/data.h5', 'obj1', where=['index < 3'])
df_hdf5

       Col1      Col2
0 -1.540538 -1.545130
1 -0.093953 -0.100321
2  0.460840  1.122858

## 3. feather
The feather format is adapted from the R statistical language.

In [57]:
!pip install -U pyarrow

Requirement already satisfied: pyarrow in c:\users\lzhao\anaconda3\lib\site-packages (6.0.0)
Requirement already satisfied: numpy>=1.16.6 in c:\users\lzhao\anaconda3\lib\site-packages (from pyarrow) (1.18.5)

WARNING: You are using pip version 21.3; however, version 21.3.1 is available.
You should consider upgrading via the 'c:\users\lzhao\anaconda3\python.exe -m pip install --upgrade pip' command.

In [64]:
import time
start = time.time()
# df.to_feather('Data/temp/data.feather')
# df.to_pickle('Data/temp/data2.pickle')
# df.to_csv('Data/temp/temp.csv')
end = time.time()
print("Time cost:", (end - start))

Time cost: 0.003989458084106445

In [72]:
start = time.time()
# df_feather = pd.read_feather('Data/temp/data.feather')
# df2_pickle = pd.read_pickle('Data/temp/data2.pickle')
df_csv = pd.read_csv("Data/temp/temp.csv")
end = time.time()
print("Time cost:", (end - start))
# df_feather

Time cost: 0.0049860477447509766

# III. Interacting with Databases
In a business setting, most data may not be stored in text or binary files. SQL-based relational databases (such as mySQL) are in wide use.

Python has sqlite3 package to interact with databases, and Pandas has some functions to simplify the process.

In [1]:
# Create a SQLite database
import sqlite3

query = """
CREATE TABLE test1
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('Data/temp/data2.sqlite')
con.execute(query)
con.commit()

In [2]:
# Insert a few rows of data
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test1 VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [3]:
# Select data
cursor = con.execute('SELECT * FROM test1')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [5]:
# Extract column names from description

# Solution 1: use a loop
desc = cursor.description
# print(desc)
cols = []
for elt in desc:
#     print(elt[0])
    cols.append(elt[0])
print(cols)

['a', 'b', 'c', 'd']

In [ ]:
cols = [elt[0] for elt in cursor.description]
print(cols)

In [6]:
import pandas as pd

In [7]:
# Create a pandas data frame
columns = [x[0] for x in cursor.description]
df = pd.DataFrame(rows, columns=columns)
df

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [9]:
# Use Pandas' read_sql function to read directly from a database.
pd.read_sql("SELECT * FROM test1", con)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [ ]:
# Use '' or "" wisely when defining strings
str1 = 'I said "Goodbye"'
str2 = "I said 'Goodbye'"